Repository: lnussbaum/slides-lectures
Catalog: ssh/po4a/po/*.po
Languages: fr

source: \mode<presentation> \usetheme{ln12en}
fr: \mode<presentation> \usetheme{ln12fr}

source: An introduction to SSH
fr: Introduction à SSH

source: \authorteaching \instituteiutlp \newcommand{\tilda}{\textasciitilde{}} \date{}
fr: \author[Lucas Nussbaum]{Lucas Nussbaum\\{\small\texttt{lucas.nussbaum@univ-lorraine.fr}}\small \\[0.5em] Traduction Française initiale~: François Dupont (ASRALL 2015)} \instituteiutlp \newcommand{\tilda}{\textasciitilde{}} \date{}

source: \AtBeginSection[] { \begin{frame} \frametitle{Outline} \tableofcontents[currentsection] \end{frame} }
fr: \AtBeginSection[] { \begin{frame} \frametitle{Plan} \tableofcontents[currentsection] \end{frame} }

source: SSH basics
fr: Les bases de SSH

source: SSH 101
fr: Introduction

source: Standard network protocol and service (TCP port 22)
fr: Un protocole et un service réseau standard (port TCP 22)

source: Many implementations, including:
fr: De nombreuses implémentations, dont:

source: OpenSSH: Linux/Unix, Mac OS X \alert{$\leftarrow$ this talk, mostly}
fr: OpenSSH: Linux/Unix, Mac OS X \alert{$\leftarrow$ on parle surtout de ça}

source: Putty: Windows, client only
fr: Putty: Windows, client seulement

source: Dropbear: small systems (routers, embedded)
fr: Dropbear: systèmes légers (routers, embarqué)

source: Unix command (\texttt{ssh}); server-side: \texttt{sshd}
fr: Commande Unix (\texttt{ssh}); coté serveur: \texttt{sshd}

source: Establish a \alert{secure communication channel} between two machines
fr: Établit une \alert{communication sécurisée} entre deux machines

source: Relies on cryptography
fr: S'appuie sur la cryptographie

source: Most basic usage: \alert{get shell access} on a remote machine
fr: L'usage le plus simple: \alert{l'accès shell} sur une machine distante

source: Many advanced usages:
fr: De nombreux usages avancés:

source: Data transfer (\texttt{scp}, \texttt{sftp}, \texttt{rsync})
fr: Transférer de données (\texttt{scp}, \texttt{sftp}, \texttt{rsync})

source: Connect to specific services (such as Git or SVN servers)
fr: Se connecter à des services spécifiques (Git ou SVN)

source: Dig secure tunnels through the public Internet
fr: Creuser des tunnels sécurisés à travers Internet

source: Several authentication schemes: password, public key
fr: Plusieurs systèmes d'authentification: mot de passe, clé publique

source: Basic usage
fr: Utilisation basique

source: Connecting to a remote server:\\ \texttt{\$ ssh login@remote-server} \\ $\leadsto$ Provides a shell on \textsl{remote-server}
fr: Se connecter à un serveur distant:\\ \texttt{\$ ssh login@remote-server} \\ $\leadsto$ Fournit un shell \textsl{remote-server}

source: Executing a command on a remote server:\\ \texttt{\$ ssh login@remote-server ls /etc}
fr: Exécuter une commande sur un serveur distant:\\ \texttt{\$ ssh login@remote-server ls /etc}

source: Copying data (with \texttt{scp}, similar to \texttt{cp}):\\ \texttt{\$ scp local-file login@remote-serv:remote-directory/} \\ \texttt{\$ scp login@remote-serv:remote-dir/file local-dir/}\\ Usual \texttt{cp} options work, e.g. \texttt{-r} (recursive)
fr: Copier des données (avec \texttt{scp}, similaire à \texttt{cp}):\\ \texttt{\$ scp local-file login@remote-serv:remote-directory/} \\ \texttt{\$ scp login@remote-serv:remote-dir/file local-dir/}\\ Les options habituelles de \texttt{cp} fonctionnent, comme \texttt{-r} (récursif)

source: Copying data (with \texttt{rsync}, more efficient than \texttt{scp} with many files):\\ \texttt{\$ rsync -avzP localdir login@server:path-to-rem-dir/}\\ \hbr Note: trailing slash on source matters with \texttt{rsync} (not with \texttt{cp})\\
fr: Copier des données (avec \texttt{rsync}, plus efficace que \texttt{scp} s'il y a de nombreux fichiers):\\ \texttt{\$ rsync -avzP localdir login@server:path-to-rem-dir/}\\ \hbr Note: le slash de fin est important avec \texttt{rsync} (pas avec \texttt{cp})\\

source: \texttt{rsync -a dir1 u@h:dir2} $\leadsto$ dir1 copied inside dir2
fr: \texttt{rsync -a rep1 u@h:rep2} $\leadsto$ rep1 copié dans rep2

source: \texttt{rsync -a dir1/ u@h:dir2} $\leadsto$ content of dir1 copied to dir2
fr: \texttt{rsync -a rep1/ u@h:rep2} $\leadsto$ contenu de rep1 dans rep2

source: Public-key authentication
fr: Authentification par clé publique

source: General idea:
fr: Idée générale

source: Asymmetric cryptography (or public-key cryptography):
fr: Cryptographie asymétrique (ou cryptographie à clé publique)

source: The public key is used to encrypt something
fr: La clé publique est utilisée pour chiffrer quelque chose

source: Only the private key can decrypt it
fr: Seule la clé privée peut le déchiffrer

source: User owns a private (secret) key, stored on the local machine
fr: L'utilisateur possède une clé privée (secrète), stockée sur la machine locale

source: The server has the public key corresponding to the private key
fr: Le serveur a la clé publique correspondant à la clé privée

source: Authentication = \textsl{<server> prove that you own that private key!}
fr: Authentification = \textsl{<server> prouve que tu possèdes cette clé privée!}

source: Implementation (\textsl{challenge-response authentication}):
fr: Implémentation (\textsl{Authentification par challenge-réponse}):

source: Server generates a nonce (random value)
fr: Le serveur génère un nonce (une valeur aléatoire arbitraire)

source: Server encrypts the nonce with the Client's public key
fr: Le serveur chiffre ce nonce avec la clé publique du client

source: Server sends the encrypted nonce (= the challenge) to client
fr: Le serveur envoie le nonce chiffré (= le challenge) au client

source: Client uses the private key to decrypt the challenge
fr: Le client utilise la clé privée pour déchiffrer le challenge

source: Client sends the nonce (= the response) to the Server
fr: Le client renvoie ce nonce (= la réponse) au serveur

source: Server compares the nonce with the response
fr: Le serveur compare le nonce avec la réponse

source: Public-key authentication (2)
fr: Authentification par clé publique (2)

source: Advantages:
fr: Avantages:

source: The password does not need to be sent over the network
fr: Les mots de passes ne sont pas envoyés par le réseau

source: The private key never leaves the client
fr: La clé privée ne quitte JAMAIS le client

source: The process can be automated
fr: Le procédé peut être automatisé

source: However, the private key should be protected (what if your laptop gets stolen?)
fr: Cependant, la clé privée doit être protégée (que se passerait-il si votre ordinateur portable était volé?)

source: Usually with a passphrase
fr: Habituellement avec une passphrase

source: Key-pair generation
fr: Génération d'une paire de clé

source: Creates the key-pair:
fr: Crée une paire de clés:

source: \texttt{\tilda/.ssh/id\_rsa} (private key)
fr: \texttt{\tilda/.ssh/id\_rsa} (clé privée)

source: \texttt{\tilda/.ssh/id\_rsa.pub} (public key)
fr: \texttt{\tilda/.ssh/id\_rsa.pub} (clé publique)

source: Copying the public key to the server
fr: Copier la clé publique sur un serveur

source: Example public key:\\ {\footnotesize \texttt{ssh-rsa AAAAB3NX[\ldots]hpoR3/PLlXgGcZS4oR user@my.hostname.net}}
fr: Exemple de clé publique:\\ {\footnotesize \texttt{ssh-rsa AAAAB3NX[\ldots]hpoR3/PLlXgGcZS4oR user@my.hostname.net}}

source: On the server, \texttt{\bf \tilda{}user/.ssh/authorized\_keys} contains the list of public keys authorized to connect to the \texttt{user} account
fr: Sur le serveur, \texttt{\bf \tilda{}user/.ssh/authorized\_keys} contient une liste des clés publiques autorisées à se connecter au compte \texttt{user}

source: The key can be copied manually there
fr: La clé peut y être copiée manuellement

source: Or use \texttt{ssh-copy-id} to automatically copy the key:\\ \texttt{client\$ ssh-copy-id user@server}
fr: Ou \texttt{ssh-copy-id} peut être utilisé pour copier la clé:\\ \texttt{client\$ ssh-copy-id user@server}

source: Sometimes the public key needs to be provided using a web interface (e.g. on GitHub, FusionForge, Redmine, etc.)
fr: Parfois la clé publique a besoin d'être fournie en utilisant une interface web (par exemple sur GitHub, FusionForge, Redmine, etc.)

source: Avoiding typing the passphrase
fr: Éviter de taper la passphrase

source: If the private key is not protected with a passphrase, the connection is established immediately:\\ \hbr {\ttfamily\footnotesize *** login@laptop:\tilda\$ ssh rlogin@rhost \textbf{ [ENTER]}\\ *** rlogin@rhost:\tilda\$\\ }
fr: Si la clé privée n'est pas protégée par une passphrase, la connexion est établie immédiatement:\\ \hbr {\ttfamily\footnotesize *** login@laptop:\tilda\$ ssh rlogin@rhost \textbf{ [ENTER]}\\ *** rlogin@rhost:\tilda\$\\ }

source: Otherwise, \texttt{ssh} asks for the passphrase:\\ \hbr {\ttfamily\footnotesize *** login@laptop:\tilda\$ ssh rlogin@rhost \textbf{ [ENTER]}\\ Enter passphrase for key '/home/login/id\_rsa': \textbf{[passphrase+ENTER]}\\ *** rlogin@rhost:\tilda\$\\ }
fr: Sinon, \texttt{ssh} demande la passphrase:\\ \hbr {\ttfamily\footnotesize *** login@laptop:\tilda\$ ssh rlogin@rhost \textbf{ [ENTER]}\\ Enter passphrase for key '/home/login/id\_rsa': \textbf{[passphrase+ENTER]}\\ *** rlogin@rhost:\tilda\$\\ }

source: An \textbf{SSH agent} can be used to store the decrypted private key
fr: Un \textbf{agent SSH} peut être utilisé pour stocker la clé déchiffrée

source: Most desktop environments act as SSH agents automatically
fr: La plupart des environnements de bureau peuvent jouer le rôle d'agent SSH automatiquement

source: One can be started with \texttt{ssh-agent} if needed
fr: On peut lancer \texttt{ssh-agent} si besoin

source: Add keys manually with \texttt{ssh-add}
fr: Les clés peuvent être ajoutées manuellement avec \texttt{ssh-add}

source: Checking the server's identity
fr: Vérifier l'identité du serveur

source: Checking the server identity: \texttt{known\_hosts}
fr: Vérifier l'identité du serveur : \texttt{known\_hosts}

source: Goal: detect hijacked servers\\ \textsl{What if someone replaced the server to steal passwords?}
fr: Objectif: détecter un serveur compromis \\ \textsl{Et si quelqu'un se faisait passer pour un serveur pour voler des mots de passe?}

source: When you connect to a server for the first time, \texttt{ssh} stores the server's public key in \texttt{\tilda/.ssh/known\_hosts}
fr: Quand on se connecte à un serveur pour la première fois, \texttt{ssh} stocke la clé publique du serveur dans \texttt{\tilda/.ssh/known\_hosts}

source: Checking the server identity: \texttt{known\_hosts} (2)
fr: Vérifier l'identité du serveur \texttt{known\_hosts} (2)

source: During each following connection, \texttt{ssh} ensures that the key still matches, and warns the user otherwise
fr: À chaque nouvelle connexion, \texttt{ssh} s'assure que la clé est toujours la même, ou avertit l'utilisateur dans le cas contraire

source: A truly outdated key can be removed with\\ \texttt{ssh-keygen -R server}
fr: Une clé véritablement périmée peut être supprimée avec\\ \texttt{ssh-keygen -R server}

source: Configuring SSH
fr: Configurer SSH

source: SSH gets configuration data from:
fr: SSH obtient les informations de configuration depuis:

source: command-line options (\texttt{-o ...})
fr: les options de la ligne de commande (\texttt{-o ...})

source: the user's configuration file: \texttt{\tilda/.ssh/config}
fr: le fichier de configuration de l'utilisateur: \texttt{\tilda/.ssh/config}

source: the system-wide configuration file: \texttt{/etc/ssh/ssh\_config}
fr: le fichier de configuration système: \texttt{/etc/ssh/ssh\_config}

source: Options are documented in the \texttt{ssh\_config(5)} man page
fr: Ces options sont décrites dans la page de manuel \texttt{ssh\_config(5)}

source: \texttt{\tilda/.ssh/config} contains a list of hosts (with wildcards)
fr: \texttt{\tilda/.ssh/config} contient une liste d'hôtes (avec wildcards)

source: For each parameter, the first obtained value is used\\
fr: Pour chaque paramètre, la première valeur trouvée est utilisée

source: Host-specific declarations are given near the beginning
fr: Les déclarations spécifiques à un hôte sont au début

source: General defaults at the end
fr: Les paramètres par défaut sont à la fin

source: Example: \texttt{\tilda/.ssh/config}
fr: Exemple: \texttt{\tilda/.ssh/config}

source: Host foo # alias/shortcut. 'ssh foo' works Hostname very-long-hostname.acme.net Port 2222
fr: Host foo # alias/raccourci. 'ssh foo' marche Hostname very-long-hostname.acme.net Port 2222

source: Note: \texttt{bash-completion} can auto-complete using \texttt{ssh\_config} hosts
fr: Note: \texttt{bash-completion} auto-complète avec les hôtes de \texttt{ssh\_config}

source: Advanced usage
fr: Utilisation avancée

source: SSH as a communication layer for applications
fr: SSH : couche de communication générique

source: Several applications use SSH as their communication (and authentication) layer
fr: Plusieurs applications utilisent SSH comme leur couche de communication et d'authentification

source: \texttt{scp}, \texttt{sftp}, \texttt{rsync} (data transfer)
fr: \texttt{scp}, \texttt{sftp}, \texttt{rsync} (transfert de données)

source: \texttt{lftp} (CLI) and \texttt{gftp} (GUI) support the SFTP protocol
fr: \texttt{lftp} (CLI) et \texttt{gftp} (GUI) supportent le protocole SFTP

source: \texttt{unison} (synchronization)
fr: \texttt{unison} (synchronisation)

source: \alert{Git:} \texttt{git clone ssh://git@github.com/path-to/repository.git}\\ Or: \texttt{git clone git@github.com:path-to/repository.git}
fr: \alert{Git:} \texttt{git clone ssh://git@github.com/path-to/repository.git}\\ Ou: \texttt{git clone git@github.com:path-to/repository.git}

source: Access remote filesystems over SSH: sshfs
fr: Accès à un filesystem distant: sshfs

source: \texttt{sshfs}: FUSE-based solution to access remote machines
fr: \texttt{sshfs}: Une solution basée sur FUSE pour accéder à des machines distantes

source: Ideal for remote file editing with a GUI, copying small amounts of data, etc.
fr: Idéal pour éditer un fichier en GUI à distance, copier des petits fichiers, etc...

source: Mount a remote directory:\\ \texttt{sshfs root@server:/etc /tmp/local-mountpoint}\\ Unmount: \texttt{fusermount -u /tmp/local-mountpoint}
fr: Monter un répertoire distant:\\ \texttt{sshfs root@server:/etc /tmp/local-mountpoint}\\ Démonter: \texttt{fusermount -u /tmp/local-mountpoint}

source: Combine with \texttt{afuse} to auto-mount any machine:\\ \texttt{afuse -o mount\_template="sshfs \%r:/ \%m" -o \textbackslash \\ unmount\_template="fusermount -u -z \%m" \tilda/.sshfs/}\\[0.5em] $\leadsto$ \texttt{cd \tilda/.sshfs/rhost/etc/ssh}
fr: Combiné avec \texttt{afuse} pour monter automatiquement n'importe quelle machine:\\ \texttt{afuse -o mount\_template="sshfs \%r:/ \%m" -o \textbackslash \\ unmount\_template="fusermount -u -z \%m" \tilda/.sshfs/}\\[0.5em] $\leadsto$ \texttt{cd \tilda/.sshfs/rhost/etc/ssh}

source: SSH tunnels with -L and -R
fr: Tunnels SSH avec -L et -R

source: Goal: transport traffic through a secure connection
fr: Objectif: transporter le trafic dans une connection sécurisée

source: Work-around network filtering (firewalls)
fr: Contourner le filtrage réseau (pare-feux)

source: Avoid sending unencrypted data on the Internet
fr: Éviter d'envoyer des données en clair sur Internet

source: But only works for TCP connections
fr: Mais fonctionne seulement pour les connections TCP

source: \textbf{-L}: access a remote service behind a firewall (Intranet server)
fr: \textbf{-L}: accéder à un service distant derrière un pare-feu (serveur intranet)

source: Still on \textsl{Client}: \texttt{telnet localhost 12345}
fr: Encore sur \textsl{Client}: \texttt{telnet localhost 12345}

source: \textsl{Server} establishes a TCP connection to \textsl{Service}, port 1234
fr: \textsl{Server} établit une connexion TCP vers \textsl{Service}, port 1234

source: The traffic is tunnelled inside the SSH connection to \textsl{Server}
fr: Le trafic est tunnelisé dans la connexion SSH vers \textsl{Server}

source: \draw[name=client,darkred,fill] (-2.5,0) circle (2mm); \draw[name=server,darkred,fill] (2.5,0) circle (2mm); \draw (-2.5,-1) node {Client}; \draw (2.5,-1) node {Server}; \draw (7.5,-1) node[align=center] {TCP Service \\on port 1234}; \draw (0, -0.2) node [below] {\small \sl Internet}; \draw (5, -0.2) node [below] {\small \sl Private network}; \only<2->{ \draw[orange,fill,ultra thick,->] (-2.5,0) -- (7.3,0); \draw[name=client,darkred,fill] (-2.5,0) circle (2mm); \draw[name=server,darkred,fill] (2.5,0) circle (2mm); }
fr: \draw[name=client,darkred,fill] (-2.5,0) circle (2mm); \draw[name=server,darkred,fill] (2.5,0) circle (2mm); \draw (-2.5,-1) node {Client}; \draw (2.5,-1) node {Server}; \draw (7.5,-1) node[align=center] {Service TCP \\sur le port 1234}; \draw (0, -0.2) node [below] {\small \sl Internet}; \draw (5, -0.2) node [below] {\small \sl Private network}; \only<2->{ \draw[orange,fill,ultra thick,->] (-2.5,0) -- (7.3,0); \draw[name=client,darkred,fill] (-2.5,0) circle (2mm); \draw[name=server,darkred,fill] (2.5,0) circle (2mm); }

source: \textbf{-R}: provide remote access to a local private service
fr: \textbf{-R}: fournir un accès distant à un service local privé

source: On \textsl{Server}: \texttt{telnet localhost 12345}
fr: Sur \textsl{Server}: \texttt{telnet localhost 12345}

source: \textsl{Client} establishes a TCP connection to \textsl{Service}, port 1234
fr: \textsl{Client} établit une connexion TCP vers le \textsl{Service}, port 1234

source: The traffic is tunnelled inside the SSH connection to \textsl{Client}
fr: Le trafic est tunnelisé dans la connexion SSH vers le \textsl{Client}

source: \draw[name=client,darkred,fill] (-2.5,0) circle (2mm); \draw[name=server,darkred,fill] (2.5,0) circle (2mm); \draw[darkred,fill] (7.5,0) circle (2mm); \draw (2.5,-1) node {Client}; \draw (7.5,-1) node {Server}; \draw (-2.5,-1) node[align=center] {TCP Service \\on port 1234}; \draw (0, -0.2) node [below] {\small \sl Private network}; \draw (5, -0.2) node [below] {\small \sl Internet}; \only<2->{ \draw[orange,fill,ultra thick,->] (7.5,0) -- (-2.3,0); \draw[darkred,fill] (2.5,0) circle (2mm); \draw[darkred,fill] (7.5,0) circle (2mm); }
fr: \draw[name=client,darkred,fill] (-2.5,0) circle (2mm); \draw[name=server,darkred,fill] (2.5,0) circle (2mm); \draw[darkred,fill] (7.5,0) circle (2mm); \draw (2.5,-1) node {Client}; \draw (7.5,-1) node {Server}; \draw (-2.5,-1) node[align=center] {Service TCP \\sur le port 1234}; \draw (0, -0.2) node [below] {\small \sl Private network}; \draw (5, -0.2) node [below] {\small \sl Internet}; \only<2->{ \draw[orange,fill,ultra thick,->] (7.5,0) -- (-2.3,0); \draw[darkred,fill] (2.5,0) circle (2mm); \draw[darkred,fill] (7.5,0) circle (2mm); }

source: SSH tunnels don't work very well for HTTP, because IP+port are not enough to identify a website (\texttt{Host:} HTTP header)
fr: Note: les tunnels SSH marchent mal pour HTTP, car IP+port est insuffisant pour identifier un site web (en-tête \texttt{Host:})

source: By default, tunnels are only bound to localhost. Use \texttt{-g} (gateway) to allow remote hosts to connect to local forwarded ports
fr: Les tunnels n'écoutent que localement. Pour permettre à des machines distantes de s'y connecter: \texttt{-g} (gateway)

source: X11 forwarding with -X: GUI apps over SSH
fr: Applis GUI X11 à travers SSH : -X

source: Run a graphical application on a remote machine, display locally
fr: Lancer une application graphique sur une machine distante pour l'afficher localement

source: Similar to VNC, but on a per-application basis
fr: Similaire à VNC mais fonctionne par applications

source: \texttt{\$DISPLAY} will be set by SSH on the server:\\ \texttt{\$ echo \$DISPLAY\\ localhost:10.0}
fr: \texttt{\$DISPLAY} sera déclaré par SSH sur le serveur:\\ \texttt{\$ echo \$DISPLAY\\ localhost:10.0}

source: Then start GUI applications on server (e.g. \texttt{xeyes})
fr: Puis lancer les applications sur le serveur (par exemple \texttt{xeyes})

source: Troubleshooting:
fr: Problèmes courants:

source: \texttt{xauth} must be installed on the remote machine
fr: \texttt{xauth} doit être installé sur la machine distante

source: The local Xorg server must allow TCP connections
fr: Le serveur Xorg local doit autoriser les connections TCP

source: \texttt{pgrep -a Xorg} $\leadsto$ \texttt{-nolisten} must not be included
fr: \texttt{pgrep -a Xorg} $\leadsto$ \texttt{-nolisten} ne doit pas être défini

source: Can be configured in your login manager
fr: Configurable dans le gestionnaire de sessions utilisateur

source: Does not work very well over slow or high-latency connections
fr: Fonctionne mal sur des connexions lentes ou à forte latence

source: SOCKS proxy with -D
fr: SOCKS proxy avec -D

source: SOCKS: protocol to proxy TCP connections via a remote machine
fr: SOCKS: protocole pour proxifier des connexions TCP via une machine distante

source: SSH can act as a SOCKS server: \texttt{ssh -D 1080 server}
fr: SSH peut agir en tant que serveur SOCKS: \texttt{ssh -D 1080 server}

source: Use case similar to tunnelling with -L, but more flexible
fr: Similaire aux tunnels avec -L mais en plus flexible

source: Set up the proxy once, use for multiple connections
fr: Le proxy peut servir pour plusieurs connexions

source: Usage:
fr: Utilisation:

source: Manual: configure applications to use the SOCKS proxy
fr: Manuel: configurer les applications pour utiliser le proxy

source: Transparent: use \texttt{tsocks} to re-route connections via SOCKS
fr: Transparent: utiliser \texttt{tsocks} pour re-router les connections

source: [basicstyle=\ttfamily\small,escapeinside={||}] $ cat /etc/tsocks.conf server = 127.0.0.1 server_type = 5 server_port = 1080 # then start ssh with -D 1080 $ tsocks pidgin # tunnel application through socks
fr: [basicstyle=\ttfamily\small,escapeinside={||}] $ cat /etc/tsocks.conf server = 127.0.0.1 server_type = 5 server_port = 1080 # puis, lancer ssh avec -D 1080 $ tsocks pidgin # proxifier l'application

source: Another transparent proxifier is \texttt{redsocks} (uses \texttt{iptables} rules to redirect to a local daemon instead of \texttt{LD\_PRELOAD})
fr: Autre proxy transparent: \texttt{redsocks} (utilise \texttt{iptables} pour rediriger vers un service local au lieu de \texttt{LD\_PRELOAD})

source: VPN over SSH
fr: VPN sur SSH

source: Built-in support for tun-based VPN
fr: SSH intègre un VPN avec \textsl{devices} tun

source: \texttt{PermitTunnel yes} required on server (disabled by default)
fr: nécessaire d'activer \texttt{PermitTunnel yes} côté serveur

source: \texttt{ssh -w 0:0 root@server} (0, 0 are the tun device numbers)
fr: \texttt{ssh -w 0:0 root@server} (0, 0 sont les numéros des tuns)

source: Then configure IP addresses and routing on both sides
fr: Puis configurer les adresses IP des deux côtés

source: \texttt{sshuttle}: another VPN over SSH solution
fr: \texttt{sshuttle}: une autre solution de VPN sur SSH

source: Root access not required on the server side
fr: Accès Root non nécessaire côté serveur

source: Idea similar to \texttt{slirp}
fr: Idée similaire à \texttt{slirp}

source: Uses \texttt{iptables} rules to redirect traffic to VPN
fr: Utilise des règles \texttt{iptables} pour rediriger le trafic vers le VPN

source: Limitation: does not support tunnelling UDP or ICMP traffic
fr: Limitation: ne permet pas de tunneller du trafic UDP ou ICMP

source: Jumping through hosts with ProxyCommand
fr: Passer d'hôtes en hôtes avec ProxyCommand
