Repository: lnussbaum/slides-lectures
Catalog: ssh/po4a/po/*.po
Languages: fr

source: \node[name=internet,gray,cloud,aspect=1,cloud puffs=23,minimum width=5cm,minimum height=2cm,draw] at (0,0) {}; \node[name=private,gray,cloud,aspect=1,cloud puffs=23,minimum width=5cm,minimum height=2cm,draw] at (5,0) {}; \draw[name=client,darkred,fill] (-2.5,0) circle (2mm); \draw[name=server,darkred,fill] (2.5,0) circle (2mm); \draw[darkred,fill] (7.5,0) circle (2mm); \draw (-2.5,-1) node {Client}; \draw (2.5,-1) node[align=center] {Server\\(gateway, firewall, etc.)}; \draw (7.5,-1) node[align=center] {Server2 on\\ private network}; \draw (5, -0.2) node [below] {\small \sl Private network}; \draw (0, -0.2) node [below] {\small \sl Internet}; \draw[orange,fill,ultra thick,->] (-2.3,0) -- (2.3,0); \draw[orange,fill,ultra thick,->] (2.7,0) -- (7.3,0);
fr: \node[name=internet,gray,cloud,aspect=1,cloud puffs=23,minimum width=5cm,minimum height=2cm,draw] at (0,0) {}; \node[name=private,gray,cloud,aspect=1,cloud puffs=23,minimum width=5cm,minimum height=2cm,draw] at (5,0) {}; \draw[name=client,darkred,fill] (-2.5,0) circle (2mm); \draw[name=server,darkred,fill] (2.5,0) circle (2mm); \draw[darkred,fill] (7.5,0) circle (2mm); \draw (-2.5,-1) node {Client}; \draw (2.5,-1) node[align=center] {Server\\(gateway, firewall, etc.)}; \draw (7.5,-1) node[align=center] {Server2 \\ réseau privé}; \draw (5, -0.2) node [below] {\small \sl Réseau privé}; \draw (0, -0.2) node [below] {\small \sl Internet}; \draw[orange,fill,ultra thick,->] (-2.3,0) -- (2.3,0); \draw[orange,fill,ultra thick,->] (2.7,0) -- (7.3,0);

source: Problem: to connect to Server2, you need to connect to Server
fr: Pour se connecter à Server2, il faut se connecter à Server

source: Can you do that in a single step? (required for data transfer, tunnels, X11 forwarding)
fr: Comment le faire en une étape? (requis pour les transferts de données, tunnels, X11 forwarding)

source: Combines two SSH features:
fr: Combine deux fonctionnalités de SSH

source: \texttt{ProxyCommand} option: command used to connect to host; connection available on standard input \& output
fr: L'option \texttt{ProxyCommand}: commande utilisée pour se connecter à un hôte; la connection doit être disponible sur les entrées et sorties standard

source: \texttt{ssh -W host:port} $\leadsto$ establish a TCP connection, provide it on standard input \& output (suitable for \texttt{ProxyCommand})
fr: \texttt{ssh -W host:port} $\leadsto$ établit une connection TCP, la donne sur l'entrée/sortie standard (adapté pour \texttt{ProxyCommand})

source: Jumping through hosts with ProxyCommand (2)
fr: Passer d'hôtes en hôtes avec ProxyCommand (2)

source: Example configuration:
fr: Exemple de configuration:

source: [basicstyle=\ttfamily\small,escapeinside={||}] Host server2 # ssh server2 works ProxyCommand ssh -W server2:22 server
fr: [basicstyle=\ttfamily\small,escapeinside={||}] Host server2 # ssh server2 marche ProxyCommand ssh -W server2:22 server

source: Also works with wildcards
fr: Fonctionne aussi avec les wildcards

source: [basicstyle=\ttfamily\small,escapeinside={||}] Host *.priv # ssh host1.priv works ProxyCommand ssh -W $(basename %h .priv):%p server
fr: [basicstyle=\ttfamily\small,escapeinside={||}] Host *.priv # ssh host1.priv marche ProxyCommand ssh -W $(basename %h .priv):%p server

source: \texttt{-W} only available since OpenSSH 5.4 (circa 2010), but the same can be achieved with \texttt{netcat}:
fr: \texttt{-W} est disponible depuis OpenSSH 5.4 ($\approx$ 2010), mais peut être réalisé avec \texttt{netcat}:

source: Similar solution to connect via a proxy:
fr: Solution similaire pour se connecter via un proxy:

source: HTTP (with CONNECT): \texttt{corkscrew myproxy 1080 rhost 22}
fr: HTTP (avec CONNECT): \texttt{corkscrew myproxy 1080 rhost 22}

source: When CONNECT requests are forbidden, set up \texttt{httptunnel} on a remote server, and use \texttt{htc} and \texttt{hts}
fr: Si les requêtes CONNECT sont interdites, activer \texttt{httptunnel} sur un serveur distant puis utiliser \texttt{htc} et \texttt{hts}

source: Triggering remote command execution securely
fr: Déclencher des commandes distantes

source: Goal: notify Server2 that something finished on Server1
fr: Objectif: notifier Server2 d'un évènement, depuis Server1

source: But Server1 must not have full shell access on Server2
fr: Mais Server1 ne doit pas avoir un accès shell sur Server2

source: Method: limit to a single command in \texttt{authorized\_keys}
fr: Méthode: limiter l'accès à une seule commande dans \texttt{authorized\_keys}

source: Also known as SSH triggers
fr: Aussi connu sous le nom de \textsl{SSH triggers}

source: Example \texttt{authorized\_keys} on Server2:
fr: Exemple d'\texttt{authorized\_keys} sur Server2:

source: Escape sequences
fr: Séquences d'échappement

source: Goal: interact with an already established SSH connection
fr: Objectif: interagir avec une connexion SSH déjà établie

source: Add tunnels or SOCKS proxy, kill unresponsive connection
fr: Ajouter des tunnels ou des proxy SOCKS, terminer les connexions qui ne répondent pas

source: Escape sequences start with '\tilda', at the beginning of a line
fr: Les séquences démarrent avec un '\tilda' au début de ligne

source: So press \texttt{[enter]}, then \texttt{\tilda}, then e.g. '\texttt{?}'
fr: Presser \texttt{[enter]} puis \texttt{\tilda} puis, par exemple '\texttt{?}'

source: Main sequences (others documented in \texttt{ssh(1)}):
fr: Séquences principales (autres documentées dans \texttt{ssh(1)}):

source: \texttt{\tilda{}.} -- disconnect (for unresponsive connections)
fr: \texttt{\tilda{}.} -- déconnexion (si la connexion ne répond pas)

source: \texttt{\tilda{}?} -- show the list of escape sequences
fr: \texttt{\tilda{}?} -- affiche la liste des séquences d'échappement

source: \texttt{\tilda{}C} -- open SSH command-line. e.g. \texttt{\tilda{}C -D 1080}
fr: \texttt{\tilda{}C} -- ligne de commande openSSH, par exemple \texttt{\tilda{}C -D 1080}

source: \texttt{\tilda{}\&} -- logout and background SSH while waiting for forwarded connections or X11 sessions to terminate
fr: \texttt{\tilda{}\&} -- logout et mettre SSH en tâche de fond pendant que les tunnels ou les sessions X11 se terminent

source: Related tools
fr: Autres outils liés

source: \texttt{mosh}: SSH alternative suited for Wi-Fi, cellular and long distance links
fr: \texttt{mosh}, une alternative à SSH adaptée aux connections mobiles, longue distance et aux réseaux Wi-Fi

source: Conclusions
fr: Conclusion

source: The Swiss-army knife of remote administration
fr: Le couteau suisse de l'administration à distance

source: Very powerful tool, many useful features
fr: Disposant de nombreuses fonctionnalités utiles et puissantes

source: Practical session: test everything mentioned in this presentation
fr: TP: tester tous les exemples mentionnés dans cette présentation

source: Key-based authentication
fr: Authentification par clé

source: Using an SSH agent
fr: Utilisation d'un agent SSH

source: aliases in SSH configuration
fr: Aliass dans la configuration SSH

source: SSH tunnels
fr: Tunnels SSH

source: SOCKS proxy with \texttt{tsocks}
fr: SOCKS proxy avec \texttt{tsocks}

source: Jumping through hosts
fr: Passer d'hôtes en hôtes avec ProxyCommand
