Repository: lnussbaum/slides-lectures
Catalog: po4a/po/*.po
Languages: fr

source: \mode<presentation> \usetheme{ln12en}
fr: \mode<presentation> \usetheme{ln12fr}

source: An introduction to SSH
fr: Introduction à SSH

source: SSH basics
fr: Les bases de SSH

source: Standard network protocol and service (TCP port 22)
fr: Un protocole et un service réseau standard (port TCP 22)

source: Many implementations, including:
fr: De nombreuses implémentations, dont:

source: OpenSSH: Linux/Unix, Mac OS X \alert{$\leftarrow$ this talk, mostly}
fr: OpenSSH: Linux/Unix, Mac OS X \alert{$\leftarrow$ on parle surtout de ca}

source: Putty: Windows, client only
fr: Putty: Windows, client seulement

source: Dropbear: small systems (routers, embedded)
fr: Dropbear: systèmes restreints (routers, embarqué)

source: Unix command (\texttt{ssh}); server-side: \texttt{sshd}
fr: La commande Unix (\texttt{ssh}); coté serveur: \texttt{sshd}

source: Establish a \alert{secure communication channel} between two machines
fr: Établit une \alert{communication sur un canal sécurisé} entre deux machines

source: Relies on cryptography
fr: S'appuie sur la cryptogrphie

source: Most basic usage: \alert{get shell access} on a remote machine
fr: L'usage le plus simple: \alert{obtenir un accès shell} sur une machine distante

source: Many advanced usages:
fr: De nombreux usages avancés:

source: Data transfer (\texttt{scp}, \texttt{sftp}, \texttt{rsync})
fr: Transfert de données (\texttt{scp}, \texttt{sftp}, \texttt{rsync})

source: Connect to specific services (such as Git or SVN servers)
fr: Connexion à des services specifiques (comme des serveurs Git ou SVN )

source: Dig secure tunnels through the public Internet
fr: "Creuse" des tunnels sécurisés à travers l'internet

source: Several authentication schemes: password, public key
fr: Plusieurs systèmes d'authentification: mot de passe, clef publique

source: Basic usage
fr: Utilisation basique

source: Connecting to a remote server:\\ \texttt{\$ ssh login@remote-server} \\ $\leadsto$ Provides a shell on \textsl{remote-server}
fr: Se connecter à un serveur distant:\\ \texttt{\$ ssh login@remote-server} \\ $\leadsto$ Fournit un shell \textsl{remote-server}

source: Executing a command on a remote server:\\ \texttt{\$ ssh login@remote-server ls /etc}
fr: Éxecuter une commande sur un serveur distant:\\ \texttt{\$ ssh login@remote-server ls /etc}

source: Copying data (with \texttt{rsync}, more efficient than \texttt{scp} with many files):\\ \texttt{\$ rsync -avzP localdir login@server:path-to-rem-dir/}\\ \hbr Note: trailing slash on source matters with \texttt{rsync} (not with \texttt{cp})\\
fr: Copier des données (avec \texttt{rsync}, est plus efficace qu'avec \texttt{scp} si il y a pleins de fichiers):\\ \texttt{\$ rsync -avzP localdir login@server:path-to-rem-dir/}\\ \hbr Note: le slash de fin importe avec \texttt{rsync} (pas avec \texttt{cp})\\

source: \texttt{rsync -a dir1 u@h:dir2} $\leadsto$ dir1 copied inside dir2
fr: \texttt{rsync -a dir1 u@h:dir2} $\leadsto$ répertoire1 copié dans répertoire2

source: \texttt{rsync -a dir1/ u@h:dir2} $\leadsto$ content of dir1 copied to dir2
fr: \texttt{rsync -a dir1/ u@h:dir2} $\leadsto$ le contenu de répertoire1 est copié dans répertoire2

source: Public-key authentication
fr: Authentification par clef publique

source: General idea:
fr: Idée générale

source: Asymmetric cryptography (or public-key cryptography):
fr: Cryptographie asymétrique (ou cryptographie à clé publique)

source: The public key is used to encrypt something
fr: La clef publique est utilisé pour chiffrer quelque chose

source: Only the private key can decrypt it
fr: Que seul la clef privée peut déchiffrer

source: User owns a private (secret) key, stored on the local machine
fr: L'utilisateur possède une clef privée (secrète), stockée sur la machine locale

source: The server has the public key corresponding to the private key
fr: Le serveur a une clef publique correspondant e à la clef privée

source: Authentication = \textsl{<server> prove that you own that private key!}
fr: Authentification = \textsl{<server> prouve que tu possèdes cette clef privée!}

source: Implementation (\textsl{challenge-response authentication}):
fr: Implémentation (\textsl{Authentification par challenge-réponse}):

source: Server generates a nonce (random value)
fr: Le serveur génère un nonce (une valeur aléatoire arbitraire)

source: Server encrypts the nonce with the Client's public key
fr: Le serveur chiffre ce nonce avec la clef publique du client

source: Server sends the encrypted nonce (= the challenge) to client
fr: Le serveur envoie le nonce chiffré (=le challenge) au client

source: Client uses the private key to decrypt the challenge
fr: Le client utilise la clef privée pour déchiffrer le challenge

source: Client sends the nonce (= the response) to the Server
fr: Le client renvoie ce nonce (= la réponse) au serveur

source: Server compares the nonce with the response
fr: Le serveur compare le nonce avec la réponse

source: Public-key authentication (2)
fr: Authentification par clef publique (2)

source: Advantages:
fr: Avantages

source: The password does not need to be sent over the network
fr: Les mots de passes ne sont pas envoyés par le réseau

source: The private key never leaves the client
fr: La clef privée ne quitte JAMAIS le client

source: The process can be automated
fr: Le procédé peut être automatisé

source: However, the private key should be protected (what if your laptop gets stolen?)
fr: Cependant, la clef privée doit être protégée (que se passerait-il sivotre ordinateur portable était volé?)

source: Usually with a passphrase
fr: Habituellement avec une passphrase

source: Key-pair generation
fr: Génération d'une paire de clef

source: Creates the key-pair:
fr: Créer une paire de clef

source: Copying the public key to the server
fr: Copier la clef publique sur un serveur

source: Example public key:\\ {\footnotesize \texttt{ssh-rsa AAAAB3NX[\ldots]hpoR3/PLlXgGcZS4oR user@my.hostname.net}}
fr: Exemple public key:\\ {\footnotesize \texttt{ssh-rsa AAAAB3NX[\ldots]hpoR3/PLlXgGcZS4oR user@my.hostname.net}}

source: On the server, \texttt{\bf \tilda{}user/.ssh/authorized\_keys} contains the list of public keys authorized to connect to the \texttt{user} account
fr: Sur le serveur, \texttt{\bf \tilda{}user/.ssh/authorized\_keys} contient une liste des clefs publiques autorisées au compte \texttt{user}

source: The key can be copied manually there
fr: La clef peut y être copiée manuellement

source: Or use \texttt{ssh-copy-id} to automatically copy the key:\\ \texttt{client\$ ssh-copy-id user@server}
fr: Ou utiliser \texttt{ssh-copy-id} pour copier la clef automatiquement:\\ \texttt{client\$ ssh-copy-id user@server}

source: Sometimes the public key needs to be provided using a web interface (e.g. on GitHub, FusionForge, Redmine, etc.)
fr: Parfois la clef publique a besoin d'être fournie en utilisant une interface web(e.g. sur GitHub, FusionForge, Redmine, etc.)

source: Remembering the passphrase
fr: Se souvenir de la passphrase

source: If the private key is not protected with a passphrase, the connection is established immediately:\\ \hbr {\ttfamily\footnotesize *** login@laptop:\tilda\$ ssh rlogin@rhost \textbf{ [ENTER]}\\ *** rlogin@rhost:\tilda\$\\ }
fr: Si la clef privée n'est pas protégée par une passphrase, la connexion est établie immédiatement:\\ \hbr {\ttfamily\footnotesize *** login@laptop:\tilda\$ ssh rlogin@rhost \textbf{ [ENTER]}\\ *** rlogin@rhost:\tilda\$\\ }

source: Otherwise, \texttt{ssh} asks for the passphrase:\\ \hbr {\ttfamily\footnotesize *** login@laptop:\tilda\$ ssh rlogin@rhost \textbf{ [ENTER]}\\ Enter passphrase for key '/home/login/id\_rsa': \textbf{[passphrase+ENTER]}\\ *** rlogin@rhost:\tilda\$\\ }
fr: Sinon, \texttt{ssh} demande la passphrase:\\ \hbr {\ttfamily\footnotesize *** login@laptop:\tilda\$ ssh rlogin@rhost \textbf{ [ENTER]}\\ Enter passphrase for key '/home/login/id\_rsa': \textbf{[passphrase+ENTER]}\\ *** rlogin@rhost:\tilda\$\\ }

source: An \textbf{SSH agent} can be used to remember the passphrase
fr: Un \textbf{agent SSH} peut être utilisé pour se souvenir de la passphrase

source: Most desktop environments act as SSH agents automatically
fr: La plupart des environnements de bureau peuvent jouer le rôle d'agent SSH automatiquement

source: One can be started with \texttt{ssh-agent} if needed
fr: On peut lancer \texttt{ssh-agent} si besoin

source: Add keys manually with \texttt{ssh-add}
fr: On ajoute les clefs manuellement avec \texttt{ssh-add}

source: Checking the server's identity
fr: Vérifier l'identité du serveur

source: Checking the server identity: \texttt{known\_hosts}
fr: Verifier l'identité du serveur : \texttt{known\_hosts}

source: Goal: detect hijacked servers\\ \textsl{What if someone replaced the server to steal passwords?}
fr: Objectif: détecter un serveur contrefait \\ \textsl{Et si quelqu'un se faisait passer pour un serveur pour voler des mots de passe?}

source: When you connect to a server for the first time, \texttt{ssh} stores the server's public key in \texttt{\tilda/.ssh/known\_hosts}
fr: Quand on se connecte à un serveur pour la première fois, \texttt{ssh} stocke la clef publique du serveur dans \texttt{\tilda/.ssh/known\_hosts}

source: Checking the server identity: \texttt{known\_hosts} (2)
fr: Vérifier l'identité du serveur \texttt{known\_hosts} (2)

source: During each following connection, \texttt{ssh} ensures that the key still matches, and warns the user otherwise
fr: À chaque nouvelle connexion, \texttt{ssh} s'assure que la clef est toujours la même, ou averti l'utilisateur dans le cas contraire

source: Remove a truly outdated key can be removed with\\ \texttt{ssh-keygen -R server}
fr: Supprimer une véritable clef périmée avec \\ \texttt{ssh-keygen -R server}

source: Configuring SSH
fr: Configurer SSH

source: SSH gets configuration data from:
fr: SSH obtient les informations de configuration depuis:

source: command-line options (\texttt{-o ...})
fr: les options de la ligne de commande (\texttt{-o ...})

source: the user's configuration file: \texttt{\tilda/.ssh/config}
fr: le fichier de configuration de l'utilisateur: \texttt{\tilda/.ssh/config}

source: the system-wide configuration file: \texttt{/etc/ssh/ssh\_config}
fr: le fichier de configuration système: \texttt{/etc/ssh/ssh\_config}

source: Options are documented in the \texttt{ssh\_config(5)} man page
fr: Ces options sont documentées dans la page de manuel \texttt{ssh\_config(5)}

source: \texttt{\tilda/.ssh/config} contains a list of hosts (with wildcards)
fr: \texttt{\tilda/.ssh/config} contient une liste d'hôtes (avec wildcards)

source: For each parameter, the first obtained value is used\\
fr: Pour chaque paramètre, c'est la première valeur trouvée que l'on utilise

source: Host-specific declarations are given near the beginning
fr: Les déclarations spécifiques à l'hôte sont données au début

source: General defaults at the end
fr: Paramètres par défaut à la fin

source: Example: \texttt{\tilda/.ssh/config}
fr: Exemple: \texttt{\tilda/.ssh/config}

source: Note: \texttt{bash-completion} can auto-complete using \texttt{ssh\_config} hosts
fr: Note: \texttt{bash-completion} peut auto-compléter en utilisant les hôtes de \texttt{ssh\_config}

source: Advanced usage
fr: Utilisation avancée

source: SSH as a communication layer for applications
fr: SSH, une couche communication pour les applications

source: Several applications use SSH as their communication layer\\
fr: Plusieurs applications utilisent SSH comme leur couche communication

source: Sometimes also authentication layer
fr: Parfois aussi comme couche d'authentification

source: \texttt{scp}, \texttt{sftp}, \texttt{rsync} (data transfer)
fr: \texttt{scp}, \texttt{sftp}, \texttt{rsync} (transfert de donnée)

source: \texttt{unison} (synchronization)
fr: \texttt{unison} (synchronisation)

source: \alert{Git:} \texttt{git clone ssh://git@github.com/path-to/repository.git}\\ Or: \texttt{git clone git@github.com:path-to/repository.git}
fr: \alert{Git:} \texttt{git clone ssh://git@github.com/path-to/repository.git}\\ Ou: \texttt{git clone git@github.com:path-to/repository.git}

source: Access remote filesystems over SSH: sshfs
fr: Accès à un filesystem distant à travers SSH: sshfs

source: \texttt{sshfs}: FUSE-based solution to access remote machines
fr: \texttt{sshfs}: Des solution basées sur FUSE pour accéder à des machines distantes

source: Ideal for remote file editing with a GUI, copying small amounts of data, etc.
fr: Idéal pour editer un fichier en GUI à distance, copier des petites quantitées de données, etc...

source: Mount a remote directory:\\ \texttt{sshfs root@server:/etc /tmp/local-mountpoint}\\ Unmount: \texttt{fusermount -u /tmp/local-mountpoint}
fr: Monter un répertoire distant:\\ \texttt{sshfs root@server:/etc /tmp/local-mountpoint}\\ Démonter: \texttt{fusermount -u /tmp/local-mountpoint}

source: Combine with \texttt{afuse} to auto-mount any machine:\\ \texttt{afuse -o mount\_template="sshfs \%r:/ \%m" -o \textbackslash \\ unmount\_template="fusermount -u -z \%m" \tilda/.sshfs/}\\[0.5em] $\leadsto$ \texttt{cd \tilda/.sshfs/rhost/etc/ssh}
fr: Combiné avec \texttt{afuse} pour monter automatiquement n'importe quelle machine:\\ \texttt{afuse -o mount\_template="sshfs \%r:/ \%m" -o \textbackslash \\ unmount\_template="fusermount -u -z \%m" \tilda/.sshfs/}\\[0.5em] $\leadsto$ \texttt{cd \tilda/.sshfs/rhost/etc/ssh}

source: SSH tunnels with -L and -R
fr: Tunnels SSH avec -L et -R

source: Goal: transport traffic through a secure connection
fr: Objectif: transporter le traffic dans une connection sécurisée

source: Work-around network filtering (firewalls)
fr: Contourner le filtrage réseau (pare-feux)

source: Avoid sending unencrypted data on the Internet
fr: Éviter d'envoyer des données en clair sur Internet

source: But only works for TCP connections
fr: Mais fonctionne seulement pour les connections TCP

source: \textbf{-L}: access a remote service behind a firewall (Intranet server)
fr: \textbf{-L}: accèder à un service distant derrière un pare-feux (serveur intranet)

source: Still on \textsl{Client}: \texttt{telnet localhost 12345}
fr: Toujours sur \textsl{Client}: \texttt{telnet localhost 12345}

source: \textsl{Server} establishes a TCP connection to \textsl{Service}, port 1234
fr: \textsl{Server} établit une connexion TCP vers \textsl{Service}, port 1234

source: The traffic is tunnelled inside the SSH connection to \textsl{Server}
fr: Le trafic est tunnelisé dans la connexion SSH vers \textsl{Server}

source: \textbf{-R}: provide remote access to a local private service
fr: \textbf{-R}: fournit un accès distant à un service local privé

source: On \textsl{Server}: \texttt{telnet localhost 12345}
fr: Sur \textsl{Server}: \texttt{telnet localhost 12345}

source: \textsl{Client} establishes a TCP connection to \textsl{Service}, port 1234
fr: \textsl{Client} établit une connexion TCP vers le \textsl{Service}, port 1234

source: The traffic is tunnelled inside the SSH connection to \textsl{Client}
fr: Le trafic est tunnellisé dans la connexion SSH vers le \textsl{Client}

source: Note: SSH tunnels don't work very well for HTTP, because IP+port are not enough to identify a website (\texttt{Host:} HTTP header)
fr: Note: les tunnels SSH ne fonctionnent pas très bien pour HTTP, parce que IP+port est insufisant pour identifier un site web (\texttt{Host:} HTTP header)

source: X11 forwarding with -X: GUI apps over SSH
fr: X11 transféré à l'aide de -X: applications GUI à travers SSH

source: Run a graphical application on a remote machine, display locally
fr: Lancer une application graphique sur une machine distante pour l'afficher localement

source: Similar to VNC, but on a per-application basis
fr: Similaire à VNC mais fonctionne par applications

source: \texttt{\$DISPLAY} will be set by SSH on the server:\\ \texttt{\$ echo \$DISPLAY\\ localhost:10.0}
fr: \texttt{\$DISPLAY} sera déclaré par SSH sur le serveur:\\ \texttt{\$ echo \$DISPLAY\\ localhost:10.0}

source: Then start GUI applications on server (e.g. \texttt{xeyes})
fr: Puis lancer les applications sur le serveur (e.g. \texttt{xeyes})

source: Troubleshooting:
fr: Diagnostic:

source: \texttt{xauth} must be installed on the remote machine
fr: \texttt{xauth} doit être installé sur la machine distante

source: The local Xorg server must allow TCP connections
fr: Le serveur Xorg local doit autoriser les connections TCP

source: \texttt{pgrep -a Xorg} $\leadsto$ \texttt{-nolisten} must not be included
fr: \texttt{pgrep -a Xorg} $\leadsto$ \texttt{-nolisten} ne doit pas être inclus

source: Can be configured in your login manager
fr: Peut être configuré dans le gestionnaire de sessions utilisateur

source: Does not work very well over slow or high-latency connections
fr: Ne fonctionne pas bien sur des connexions lentes ou à forte latence

source: SOCKS proxy with -D
fr: SOCKS proxy avec -D

source: SOCKS: protocol to proxy TCP connections via a remote machine
fr: SOCKS: protocole des connexions proxy TCP via une machine distance

source: SSH can act as a SOCKS server: \texttt{ssh -D 1080 server}
fr: SSH peut agir en tant que serveur SOCKS: \texttt{ssh -D 1080 server}

source: Use case similar to tunnelling with -L, but more flexible
fr: Cas d'utilisation similaires aux tunnels avec -L mais en plus flexible

source: Set up the proxy once, use for multiple connections
fr: Mettre en place le proxy pour plusieurs connexions

source: Usage:
fr: Utilisation:

source: Manual: configure applications to use the SOCKS proxy
fr: Manuel: configurer les applications pour uiliser le proxy SOCKS

source: Transparent: use \texttt{tsocks} to re-route connections via SOCKS
fr: Transparent: utiliser \texttt{tsocks} pour re-router les connections via SOCKS

source: [basicstyle=\ttfamily\small,escapeinside={||}] $ cat /etc/tsocks.conf server = 127.0.0.1 server_type = 5 server_port = 1080 # then start ssh with -D 1080 $ tsocks pidgin # tunnel application through socks
fr: [basicstyle=\ttfamily\small,escapeinside={||}] $ cat /etc/tsocks.conf server = 127.0.0.1 server_type = 5 server_port = 1080 # puis, lancer ssh avec -D 1080 $ tsocks pidgin # tunneliser l'application à travers le socket

source: Jumping through hosts with ProxyCommand
fr: Passer d'hôtes en hôtes avec ProxyCommand (2)

source: Problem: to connect to Server2, you need to connect to Server
fr: Problème: pour se connecter à Server2, il faut se connecter à Server1

source: Can you do that in a single step? (required for data transfer, tunnels, X11 forwarding)
fr: Pouvez-vous le faire en une étape? (requis pour les transferts de données, tunnels, X11 forwarding)

source: Combines two SSH features:
fr: Combine deux fonctionnalités de SSH

source: \texttt{ProxyCommand} option: command used to connect to host; connection available on standard input \& output
fr: l'option \texttt{ProxyCommand}: connexion vers l'hôte disponible sur l'entrée/sortie standard

source: \texttt{ssh -W host:port} $\leadsto$ establish a TCP connection, provide it on standard input \& output (suitable for \texttt{ProxyCommand})
fr: \texttt{ssh -W host:port} $\leadsto$ établit une connection TCP sur l'entrée/sortie standard (adaptée pour \texttt{ProxyCommand})

source: Jumping through hosts with ProxyCommand (2)
fr: Passer d'hôtes en hôtes avec ProxyCommand (2)

source: Example configuration:
fr: Exemple de configuration

source: Also works with wildcards
fr: Fonctionne aussi avec les wildcards

source: -W only available since OpenSSH 5.4 (circa 2010), but the same can be achieved with netcat:
fr: -W est disponible depuis OpenSSH 5.4 (circa 2010), mais peut être réalisé avec netcat

source: Similar solution to connect via a proxy:
fr: Solution similaire de connexion via un proxy:

source: When CONNECT requests are forbidden, set up \texttt{httptunnel} on a remote server, and use \texttt{htc} and \texttt{hts}
fr: Si les requêtes CONNECT sont interdites, activer \texttt{httptunnel} sur un serveur distant puis utiliser \texttt{htc} et \texttt{hts}

source: Triggering remote command execution securely
fr: Déclancher l'exécution de commandes distantes en toute sécurité

source: Goal: notify Server2 that something finished on Server1
fr: Objectif: notifier Server2 que quelque chose s'est terminé sur Server1

source: But Server1 must not have full shell access on Server2
fr: Mais Server1 ne doit pas avoir un accès shell total sur Server2

source: Method: limit to a single command in \texttt{authorized\_keys}
fr: Méthode: limiter l'accès à une seule commande dans \texttt{authorized\_keys}

source: Also known as SSH triggers
fr: Aussi connu sous le nom de "SSH triggers"

source: Example \texttt{authorized\_keys} on Server2:
fr: Exemple d'\texttt{authorized\_keys} sur Server2:

source: Escape sequences
fr: Séquences d'échappement

source: Goal: interact with an already established SSH connection
fr: Objectif: interagir avec une connexion SSH déjà établie

source: Add tunnels or SOCKS proxy, kill unresponsive connection
fr: Ajouter des tunnels ou des proxy SOCKS, terminer les connections qui ne répondent pas

source: Escape sequences start with '\tilda', at the beginning of a line
fr: Les séquences d'échappement avec '\tilda' au début de ligne

source: So press \texttt{[enter]}, then \texttt{\tilda}, then e.g. '\texttt{?}'
fr: Presser \texttt{[enter]} puis \{texttt{\tilda} puis, par exemple '\texttt{?}'

source: Main sequences (others documented in \texttt{ssh(1)}):
fr: Séquences principales (autres documéntées dans \texttt{ssh(1)}):

source: \texttt{\tilda{}.} -- disconnect (for unresponsive connections)
fr: \texttt{\tilda{}.} -- déconnexion (si elle ne répond pas)

source: \texttt{\tilda{}?} -- show the list of escape sequences
fr: \texttt{\tilda{}?} -- affiche la liste des séquences d'échappement

source: \texttt{\tilda{}C} -- open SSH command-line. e.g. \texttt{\tilda{}C -D 1080}
fr: \texttt{\tilda{}C} -- ligne de commande openSSH, par exemple \texttt{\tilda{}C -D1080}

source: \texttt{\tilda{}\&} -- logout and background SSH while waiting for forwarded connections or X11 sessions to terminate
fr: \texttt{\tilda{}\&} -- déconnecter et mettre SSH en tâche de fond pendant que les transmissions ou les sessions X11 se terminent

source: The Swiss-army knife of remote administration
fr: Le couteau Suisse de l'administration à distance

source: Very powerful tool, many useful features
fr: Disposant de nombreuses fonctionnalités utiles et puissantes

source: Practical session: test everything mentioned in this presentation
fr: Travaux pratique: tester tous les examples mentionnés dans cette présentation

source: Other topics not covered in this presentation:
fr: Autres sujets n'étant pas abordés dans cette présentation

source: Built-in support for VPN
fr: Support du VPN intégré

source: Other authentication methods (certificates)
fr: Les autres méthodes d'authentification (certificats)

source: Managing long executions on a remote machine with \texttt{screen} or \texttt{tmux}
fr: Gestion des sessions distantes avec \texttt{screen} ou \texttt{tmux}

source: Mosh, an SSH alternative suited for Wi-Fi, cellular and long distance links
fr: Mosh, une alternative SSH adaptée pour les connections mobiles, longue distance et les réseaux Wi-Fi
